# Aula 04 - Manipulação Básica de DataFrames

## **Resumo**: Exerícios de manipulação básica de DataFrames do Pandas e de como mascarar colunas de identificação.

# I CARREGAMENTO DOS PACOTES NECESSÁRIOS

In [4]:
import os
import pandas as pd
import hashlib

from pathlib import Path

# II DIRETÓRIOS

In [5]:
os.chdir("G:\\Meu Drive\\Selection\\esm_selection")
root_dir   = Path(os.getcwd())
input_dir  = Path(root_dir, "Data/Input")
output_dir = Path(root_dir, "Data/Output")
output_dir

WindowsPath('G:/Meu Drive/Selection/esm_selection/Data/Output')

# Exercício 1: Manipulação Básica

In [6]:
# Tipos
types = {"CPF_fake": "str",
         "Salário": "float32",
         "Encargos": "int16"}

# Leitura
pagamentos = pd.read_table(Path(input_dir, "Folha_pagamento_comma.txt"), sep = ",",
                           index_col = False, dtype = types)
pagamentos.head(5)

        Nome      CPF_fake       Salário  Encargos
0      AÉLIO  908777362057  22771.880859       634
1       ALDA  324268288911  20637.560547       538
2  ALEXANDRE  766148980149  27527.339844       330
3      ALINE  575223597306  29147.300781       641
4        ANA  900619489281  37617.300781       789

In [7]:
# a)
pagamentos = pagamentos.rename(columns = {"Nome": "nome",
                                          "CPF_fake": "cpf",
                                          "Salário": "salario",
                                          "Encargos": "encargos"})
pagamentos.head(5)

        nome           cpf       salario  encargos
0      AÉLIO  908777362057  22771.880859       634
1       ALDA  324268288911  20637.560547       538
2  ALEXANDRE  766148980149  27527.339844       330
3      ALINE  575223597306  29147.300781       641
4        ANA  900619489281  37617.300781       789

In [8]:
# b)
pagamentos = pagamentos.astype({"encargos": "float32"})

pagamentos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7963 entries, 0 to 7962
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nome      7963 non-null   object
 1   cpf       7963 non-null   object
 2   salario   7963 non-null   float32
 3   encargos  7963 non-null   float32
dtypes: float32(2), object(2)
memory usage: 186.8+ KB

In [9]:
# c)
pagamentos = pagamentos.assign(custo_mensal  = lambda x: x["salario"] +  x["encargos"],
                               salario_anual = lambda x: x["salario"] * 12,
                               custo_anual   = lambda x: x["custo_mensal"] *12
                               )
pagamentos.head(5)

,nome,cpf,salario,encargos,custo_mensal,salario_anual,custo_anual
0,AÉLIO,908777362057,22771.880859,634.0,23405.880859,273262.56250,280870.56250
1,ALDA,324268288911,20637.560547,538.0,21175.560547,247650.71875,254106.71875
2,ALEXANDRE,766148980149,27527.339844,330.0,27857.339844,330328.06250,334288.06250
3,ALINE,575223597306,29147.300781,641.0,29788.300781,349767.62500,357459.62500
4,ANA,900619489281,37617.300781,789.0,38406.300781,451407.62500,460875.62500

In [10]:
# d)
pagamentos_10_25 = pagamentos.query(" salario > 10000 & salario < 25000 ")
pagamentos_10_25.head(5)

,nome,cpf,salario,encargos,custo_mensal,salario_anual,custo_anual
0,AÉLIO,908777362057,22771.880859,634.0,23405.880859,273262.56250,280870.56250
1,ALDA,324268288911,20637.560547,538.0,21175.560547,247650.71875,254106.71875
8,ARLY,314817767354,22063.419922,755.0,22818.419922,264761.03125,273821.03125
11,CRISTIANE,827111721032,16530.740234,453.0,16983.740234,198368.87500,203804.87500
19,FILIPE,111114603517,17293.740234,641.0,17934.740234,207524.87500,215216.87500

In [11]:
# e)
pagamentos = pagamentos.drop(['encargos'], axis = 1)
pagamentos.head(5)

,nome,cpf,salario,custo_mensal,salario_anual,custo_anual
0,AÉLIO,908777362057,22771.880859,23405.880859,273262.56250,280870.56250
1,ALDA,324268288911,20637.560547,21175.560547,247650.71875,254106.71875
2,ALEXANDRE,766148980149,27527.339844,27857.339844,330328.06250,334288.06250
3,ALINE,575223597306,29147.300781,29788.300781,349767.62500,357459.62500
4,ANA,900619489281,37617.300781,38406.300781,451407.62500,460875.62500

In [12]:
# f)
pagamentos = (pd.read_table(Path(input_dir, "Folha_pagamento_comma.txt"), sep = ",",
                           index_col = False, dtype = types)
              .rename(columns = {"Nome": "nome",
                                 "CPF_fake": "cpf",
                                 "Salário": "salario",
                                 "Encargos": "encargos"})
              .astype({"encargos": "float32"})
              .assign(custo_mensal  = lambda x: x["salario"] +  x["encargos"],
                      salario_anual = lambda x: x["salario"] * 12,
                      custo_anual   = lambda x: x["custo_mensal"] *12
                      )
              .drop(['encargos'], axis = 1)
             )
pagamentos.head(5)

,nome,cpf,salario,custo_mensal,salario_anual,custo_anual
0,AÉLIO,908777362057,22771.880859,23405.880859,273262.56250,280870.56250
1,ALDA,324268288911,20637.560547,21175.560547,247650.71875,254106.71875
2,ALEXANDRE,766148980149,27527.339844,27857.339844,330328.06250,334288.06250
3,ALINE,575223597306,29147.300781,29788.300781,349767.62500,357459.62500
4,ANA,900619489281,37617.300781,38406.300781,451407.62500,460875.62500

# Exercício 2: Lidando com Misings

In [33]:
pagamentos_missings = pd.read_pickle(Path(input_dir, "pagamentos_missings.pickle") )

pagamentos_missings.info()
# pagamentos_missings.head()
# pagamentos_missings.tail()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7964 entries, 0 to 0
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   cpf            7963 non-null   object
 1   salario        7963 non-null   float32
 2   encargos       7961 non-null   float32
 3   custo_mensal   7963 non-null   float32
 4   salario_anual  7963 non-null   float32
 5   custo_anual    7963 non-null   float32
 6   funcao         0 non-null      float64
 7   pagamento      7963 non-null   float32
dtypes: float32(6), float64(1), object(1)
memory usage: 373.3+ KB

In [39]:
pagamentos_corrected = (pagamentos_missings
                        .T.drop_duplicates().T
                        .dropna(how = 'all', axis = 1)
                        .dropna(how = 'all', axis = 0)
                        .assign(encargos = lambda df: df["encargos"].fillna(0))
                        )
pagamentos_corrected.head()

,cpf,salario,encargos,custo_mensal,salario_anual,custo_anual
0,908777362057,22771.880859,634.0,23405.880859,273262.5625,280870.5625
1,324268288911,20637.560547,NaN,21175.560547,247650.71875,254106.71875
2,766148980149,27527.339844,NaN,27857.339844,330328.0625,334288.0625
3,575223597306,29147.300781,641.0,29788.300781,349767.625,357459.625
4,900619489281,37617.300781,789.0,38406.300781,451407.625,460875.625

# Exercício 3: Mascarando Identificação

In [10]:
# a)
pagamentos_id = (pagamentos
                 .assign(nome = lambda df:
                                 df["nome"].apply(lambda x:
                                                   hashlib.md5(x.encode('UTF-8'))
                                                   .hexdigest()
                                                   )
                         )
                 )
pagamentos_id.head(5)

,nome,cpf,salario,custo_mensal,salario_anual,custo_anual
0,e0dc2e2131e8b6f8e3193bdc704b8661,908777362057,22771.880859,23405.880859,273262.56250,280870.56250
1,1c754ccf13395ca21df421403f401d7b,324268288911,20637.560547,21175.560547,247650.71875,254106.71875
2,7490ab41686a928652d05b5a55777d44,766148980149,27527.339844,27857.339844,330328.06250,334288.06250
3,7e9532b1ccde404a8ac93a7d85fa2a8f,575223597306,29147.300781,29788.300781,349767.62500,357459.62500
4,cf886fb16b28eed1395218ce62b8509f,900619489281,37617.300781,38406.300781,451407.62500,460875.62500

In [11]:
# b)
pagamentos_masked = (pagamentos_id
                     .assign(cpf_s = lambda df: df['cpf'] + "-stark-lannister-targaryen",
                             cpf   = lambda df:
                                     df["cpf_s"].apply(lambda x:
                                                       hashlib.sha256(x.encode('UTF-8'))
                                                       .hexdigest()
                                                       )
                              )
                      .drop(["cpf_s"], axis = 1)
                      )
pagamentos_masked.head(5)

,nome,cpf,salario,custo_mensal,salario_anual,custo_anual
0,e0dc2e2131e8b6f8e3193bdc704b8661,967db7ec12a9c5c6452c83cf2d9313eb0ff751ed19cf0f...,22771.880859,23405.880859,273262.56250,280870.56250
1,1c754ccf13395ca21df421403f401d7b,a779ca71c307d8936c150330e15942cbe6c91f520069f6...,20637.560547,21175.560547,247650.71875,254106.71875
2,7490ab41686a928652d05b5a55777d44,023ae968bb3edf8b5bc79e4998e51bfd2a8a9ccd787318...,27527.339844,27857.339844,330328.06250,334288.06250
3,7e9532b1ccde404a8ac93a7d85fa2a8f,87bc9f9bb3d9d9da3ea020b8a9d8ee4fa2f383a1b537b5...,29147.300781,29788.300781,349767.62500,357459.62500
4,cf886fb16b28eed1395218ce62b8509f,cffabb8fd509f824032c2651720295d555ec52ecdb4699...,37617.300781,38406.300781,451407.62500,460875.62500

In [12]:
pagamentos_masked.to_pickle(Path(output_dir, "pagamentos_masked.pickle.xz"),
                            protocol = 5)
pagamentos_masked.to_csv(Path(output_dir, "pagamentos_masked.csv.xz"))